//  04.09.23 -  javaScript 


// __________________тип данных:___________________

//      (primitive type - простой тип)
// 1. number           - номер
// 2. string           - "строка"
// 3. boolean          - булевый значение
// 4. null             - нулевое значения (значение жок)
// 5. undefined        - белгисиз (не определено)
// 6. symbol           - символдор ( $ & @ )
// 7. bigint           - 12345k67890 (коп окшош сандарды программа оной окуш учун тамга жазып коёт)

//      (reference type - ссылочный тип)
// 8. abject           - {}




//_______________ переменный: (varibles - озгормолор)______________

// переменный var: (var - старый переменный который не используется так как много багов)
// var num = 10
// num = 20
// console.log(num)


// переменный let: (изменяемый переменный)
// let num1 = 15
// num1 = 20
// console.log(num1)


// переменный const: (не изменяемый переменный, туруктуу)
// const num2 = 20
// num2 = 30
// console.log(num2)




//___________________________operator__________________________________

// + 
// - 
// * 
// / болуу
// % калдык, остаток
// ** даража, квадрат




// оператор +
// let n = 20
// let num = 20
// console.log(n + num )

// оператор -
// let n = 20
// let num = 20
// console.log(n - num )

// оператор *
// let n = 20
// let num = 20
// console.log(n * num )


// оператор /
// let n = 20
// let num = 20
// console.log(n / num )

// оператор %
// let n = 20
// let num = 20
// console.log(n % num )

// оператор **
// let n = 20
// let num = 20
// console.log(n ** num )


//...........................................................
// home work

// 1. Вам дана переменная num, присвойте ей значение. 
//    Выведите значение этой переменной в консоль.
let num1 = 8
console.log(num1)

// 2. Вам даны переменные a=10, b=2 и c=5. 
//    Выведите в консоль их сумму.
let a = 10
let b = 2
let c = 5
console.log(a + b + c)

// 3. Вам дана переменная со значением 100, 
//    выведите в консоль умноженную переменную на 2.
let num2 = 100
console.log(num2 * 2)

// 4. Вам дана переменная со значением 67. 
//    Выведите в консоль остаток деления на 7.
let num3 = 67
console.log(num3 % 7)

// 5. Вам даны переменные a=10 и b=2. 
//    Выведите в консоль их сумму, разность, произведение и частное (результат деления).
let d = 10
let f = 2
console.log(d / f)

// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. 
//    Выведите в консоль значение переменной result.
let g = 15
let h = 2
let result = g + h
console.log(result)

// 7. Вам даны переменные a=30, и b=15 
//    Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
let v = 30
let e = 15
let j = v + e
console.log(j / 4)

// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. 
//    Выведите в консоль значение переменной result.
let z = 17
let y = 10
let k = z - y
let l = 45
let result2 = k + l
console.log(result2)










